docs/superpowers/reviews/2026-08-24-r2f1b-slice4d-mutation-control.patch
diff --git a/crates/bridge-workflow/src/scheduler_arbitration.rs b/crates/bridge-workflow/src/scheduler_arbitration.rs
--- a/crates/bridge-workflow/src/scheduler_arbitration.rs
+++ b/crates/bridge-workflow/src/scheduler_arbitration.rs
@@ -15,8 +15,8 @@ pub enum SchedulerArmV1 {
 /// The sole executable representation of scheduler priority.
 const SCHEDULER_ARM_PRIORITY_V1: [SchedulerArmV1; 8] = [
-    SchedulerArmV1::DrainReadyNodeCompletions,
     SchedulerArmV1::DurableTriggerBarrierAcknowledgements,
+    SchedulerArmV1::DrainReadyNodeCompletions,
     SchedulerArmV1::WorkflowOrExternalCancellation,
     SchedulerArmV1::FixedGraceExpiry,
     SchedulerArmV1::AbsoluteCutoff,
     SchedulerArmV1::MechanicallyProvedImpossibility,
